module/serveragent/serversoap/ServerAgentServiceSoapBinding.submitMediaToken.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:tns="http://service.annot.me/">
 <SOAP-ENV:Body>
   <tns:submitMediaToken>
    <arg0>
     <annotCount>0</annotCount>
     <blessedCount>0</blessedCount>
     <blockedCount>0</blockedCount>
     <createTime>0</createTime>
     <cursedCount>0</cursedCount>
     <digest></digest>
     <source></source>
     <part>0</part>
     <flags>0</flags>
     <id>0</id>
     <type>0</type>
     <status>0</status>
     <userId>0</userId>
     <visitedCount>0</visitedCount>
    </arg0>
    <userName></userName>
    <password></password>
   </tns:submitMediaToken>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
